[
  {
    "name": "store_memory",
    "description": "Store memories with auto-tagging and categorization. Supports 11 memory types: working-notes, decision, rule, code-snippet, learning, research, discussion, progress, task, debug, and design."
  },
  {
    "name": "search_memories",
    "description": "Find specific memories by content, topic, or file using semantic or keyword search."
  },
  {
    "name": "expand_memories",
    "description": "Expand memory summaries and/or document chunks to get full content with surrounding context."
  },
  {
    "name": "modify_memory",
    "description": "Modify existing memories: update content/type/tags/importance, inactivate (soft delete), or reactivate memories."
  },
  {
    "name": "get_insights",
    "description": "Analyze patterns, trends, and learnings across all your work. Supports comprehensive, patterns, learning, progress, quality, productivity, and technical_debt analysis types."
  },
  {
    "name": "session_recap",
    "description": "Get a summary of recent activity to resume work. Shows recent memories, pending tasks, and activity summary per project."
  },
  {
    "name": "get_rules",
    "description": "Get agent behavioral rules and guardrails. Returns rule-type memories from global and/or project-specific contexts."
  },
  {
    "name": "projects",
    "description": "Manage project documents and relationships: create/update briefs, PRDs, implementation plans, link projects, and analyze relationships."
  },
  {
    "name": "tasks",
    "description": "Manage task lifecycle: create, complete, list, or link memories to project tasks."
  },
  {
    "name": "start_thinking",
    "description": "Begin a structured thinking sequence for complex problems. Creates a thinking session for step-by-step reasoning."
  },
  {
    "name": "add_thought",
    "description": "Add a thought to an active thinking sequence. Builds up reasoning chain with observations, hypotheses, and conclusions."
  },
  {
    "name": "recallium",
    "description": "Magic summon - load all project context in one call. Gets session recap, rules, project docs, and pending tasks."
  },
  {
    "name": "help",
    "description": "Get guidance on tool selection, workflows, and best practices using progressive disclosure."
  },
  {
    "name": "check_setup_status",
    "description": "Check if Recallium setup has been completed. Verifies database connection, services initialization, and MCP tools enablement."
  },
  {
    "name": "intelligence_health_check",
    "description": "Check current intelligence tool usage and suggest improvements."
  },
  {
    "name": "validate_intelligence_usage",
    "description": "Validate if current approach follows intelligence-first rules."
  }
]
